Revit 2027 API
ExportLayerInfo.ColorName Property
 The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ColorName { get; set; }
Public Property ColorName As String
	Get
	Set
public:
property String^ ColorName {
	String^ get ();
	void set (String^ value);
}
member ColorName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace